---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FabricFailures.NoWireMaterialDensity
source: html/d99ce2f4-846c-e037-fa43-b7713b0865e1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricFailures.NoWireMaterialDensity Property

Material does not have a density defined. The weight of the Fabric Sheet cannot be computed.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoWireMaterialDensity { get; }
```